import styles from './policyPersonalData.module.scss';
import ArrowBack from '../../components/Svg/ArrowBack';
import { Link } from 'react-router-dom';


const PolicyProcessingPersonalDataDocument = () => {
    return (
        <>
            <div className={styles.wrapperArrow}>
                <Link to='/signUp-create'><ArrowBack className={styles.button}/></Link>
            </div>
            <div className={styles.titleWrapper}>
                <h2 className={styles.title}>Политика в отношении обработки персональных данных</h2>
            </div>
            <div className={styles.textWrapper}>
                <p className={styles.paragraff}>Индивидуальный предприниматель Баранова Елизавета Дмитриевна, ИНН: 502724507201, ОГРНИП: 324508100003686, именуемый в дальнейшем «Исполнитель», предлагает заключить настоящий договор (Оферту) на оказание услуг с любым физическим или юридическим лицом посредством совершения акцепта настоящей Оферты.<br/>
                В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и совершения акцепта, лицо, производящее акцепт настоящей Оферты, становится «Заказчиком».
                Согласно пункту 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте.<br/>
                1. Термины и определения<br/>
                1.1. Во избежание двусмысленности и иных недоразумений при толковании текста настоящего Договора стороны, его заключившие, пришли к соглашению, что следующие понятия будут иметь значения, определяемые ниже:<br/>
                1.1.1. Оферта – предложение Исполнителя, адресованное физическому или юридическому лицу, заключить с Исполнителем договор на оказание услуг на условиях, содержащихся в настоящей Оферте.<br/>
                1.1.2. Акцепт оферты – полное и безоговорочное согласие Заказчика с условиями настоящего договора (оферты) и осуществление оплаты по настоящему договору.<br/>
                1.1.3. Услуга – под услугами понимается предоставление доступа к Личному Кабинету на сайте https://w-2-wmatch.ru/ на срок от 1 месяца в зависимости от выбранного тарифа.<br/>
                1.1.4. Заказчик - физическое лицо или юридическое лицо, посетитель сайта, принимающий условия настоящей оферты и желающий заключить договор оказания услуг.<br/>
                1.1.5. Сайт – (https://w-2-wmatch.ru/).<br/>
                1.1.6. Исполнитель – Индивидуальный предприниматель Баранова Елизавета Дмитриевна, ИНН: 502724507201, ОГРНИП: 324508100003686.<br/>
                1.2. В Договоре могут быть использованы термины, не определенные пунктом 1.1. Договора. В этом случае толкование такого термина производится в соответствии с текстом Договора. В случае отсутствия однозначного толкования термина в тексте Договора следует руководствоваться толкованием термина, определенным: в первую очередь — законодательством РФ, во вторую очередь — на сайте https://w-2-wmatch.ru/, затем — сложившимся (общеупотребительным) в сети Интернет.<br/>
                2. Общие положения<br/>
                2.1. В рамках настоящей оферты Исполнитель предоставляет Заказчику возможность одновременно ознакомиться с предложением Исполнителя о заключении договора оказания услуг, заключить с Исполнителем договор оказания услуг, а также произвести предварительную оплату в отношении определенной услуги.<br/>
                2.2. Заключение и расторжение договора оказания услуг осуществляется в порядке, предусмотренном ГК РФ и Законом от 07.02.1992 № 2300-1 «О защите прав потребителей».<br/>
                Договор оказания услуг считается заключенным с момента полного и безоговорочного согласия Заказчика с условиями настоящего договора (оферты) и осуществление 100% оплаты по настоящему договору.<br/>
                В соответствии со ст. 434 ГК РФ настоящая оферта является равносильной договору, подписанному сторонами, имеет юридическую силу и действительна в электронном виде.<br/>
                2.3. Регистрация на сайте https://w-2-wmatch.ru/ (далее - сайт) является обязательной для заключения договора оказания услуг.<br/>
                2.4. Заказчик и Исполнитель гарантируют, что обладают необходимой дее- и правоспособностью, а также необходимыми полномочиями и правами, необходимыми для заключения договора оказания услуг.<br/>
                2.5. Исполнитель имеет право в одностороннем порядке внести изменения в настоящую оферту, которые вступают в силу по истечении 1 (одного) календарного дня с даты опубликования новой оферты на сайте.<br/>
                3. Предмет договора<br/>
                3.1. Исполнитель обязуется оказать следующие услуги: предоставление доступа к Личному Кабинету на сайте https://w-2-wmatch.ru/ на срок 12 месяцев, а Заказчик обязуется принять и оплатить данные услуги в соответствии с выбранным Заказчиком тарифом.<br/>
                3.2. Оказываемые услуги включают в себя следующее:<br/>
                3.2.1. предоставление доступа к Личному Кабинету Заказчика на сайте https://w-2-wmatch.ru/ на срок 12 месяцев
                3.2.2. Стоимость и состав пакетов, предлагаемых Исполнителем Услуг, размещены на соответствующей странице/сайте продажи такой Услуги<br/>
                3.2.3 Исполнитель обеспечивает обратную связь с Заказчиком. Обратная связь с Заказчиком осуществляется путем предоставления устных ответов на вопросы Заказчика и/или иной информационной поддержки Заказчика при получении соответствующего пакета Услуги. Объем и вид обратной связи, определяется выбранным и оплаченным Заказчиком Тарифом.<br/>
                3.2.4. оказывается Исполнителем дистанционно через сеть Интернет.<br/>
                3.2.5. После оплаты Услуг Заказчиком Исполнитель предоставляет Заказчику данные для доступа к Личному Кабинету Заказчика (логин и пароль) на сайте https://w-2-wmatch.ru/ по электронной почте или через социальную сеть Telegram в течение 5 (пяти) рабочих дней.<br/>
                3.3. Оказание услуг осуществляется Исполнителем в онлайн формате на сайте https://w-2-wmatch.ru/.<br/>
                3.4. Услуги должны быть оказаны в срок до 365 календарных дней<br/>
                3.5. Сообщая Исполнителю свой номер телефона и e-mail, Заказчик дает свое согласие на их использование в целях исполнения настоящего договора.<br/>
                3.6. Исполнитель гарантирует, что услуги, оказываемые в рамках договора оказания услуг, соответствуют требованиям законодательства РФ.<br/>
                3.7. Заказчик соглашается с условиями заключения договора оказания услуг, изложенными в настоящей оферте.<br/>
                4. Права и обязанности сторон договора<br/>
                4.1. Исполнитель обязуется:<br/>
                4.1.1. Оказать услуги, предусмотренные настоящим договором, лично.<br/>
                4.1.2. Оказать услуги надлежащего качества.<br/>
                4.1.3. Оказать услуги в полном объеме в срок, указанный в п. 3.4 настоящего договора.<br/>
                4.2. Исполнитель вправе получать от Заказчика разъяснения по всем вопросам, возникающим в ходе оказания услуг, и любую дополнительную информацию, необходимую для выполнения своих обязательств по настоящему договору.<br/>
                4.3. Заказчик обязуется:<br/>
                4.3.1. Предоставлять Исполнителю все документы и необходимую информацию для выполнения Исполнителем своих обязательств по настоящему договору.<br/>
                4.3.2. Принять оказанные услуги.<br/>
                4.3.3. Своевременно оплачивать оказанные услуги в порядке, предусмотренном разделом 5 настоящего договора.<br/>
                4.3.4. Заказчик обязуется после полной оплаты по настоящему договору зарегистрироваться на сайте Исполнителя.<br/>
                4.3.5. Не сообщать третьим лицам пароль и логин, указанные им при регистрации на сайте Исполнителя, а также незамедлительно сообщить Исполнителю о возникновении подозрений относительно безопасности его логина и пароля путем направления уведомления на электронную почту Исполнителя.<br/>
                4.4. Заказчик вправе:<br/>
                4.4.1. Получать от Исполнителя устные и письменные объяснения по вопросам, возникающим в ходе исполнения обязательств по настоящему договору.<br/>
                4.4.2. При отказе Заказчика от оказываемых услуг Исполнитель возвращает Заказчику уплаченные денежные средства в полном объеме за вычетом уже оказанных услуг и фактически понесенных расходов.<br/>
                В фактически понесенные расходы, не подлежащие возврату, входят:<br/>
                - расходы на банковские сервисы (банковские комиссии в том числе);<br/>
                - расходы на технических специалистов;<br/>
                - предоставленные Исполнителем бонусные уроки;<br/>
                - иные фактически понесенные расходы.<br/>
                Конкретная сумма фактических затрат для каждого случая определяется Исполнителем исходя из фактических обстоятельств по соответствующему заявлению о возврате.<br/>
                Возврат денежных средств за неоказанные услуги осуществляется Исполнителем в десятидневный срок со дня предъявления соответствующего требования Заказчика. При этом дальнейший срок зачисления денежных средств на счет Заказчика зависит исключительно от персональной работы, политики и оперативности обслуживающего банка.<br/>
                4.5. В случае, если Заказчик не выходит на связь с Исполнителем (не
                отвечает на звонки, сообщения и т.д.) в течение более чем 30
                календарный дней, такие действия Заказчика рассматриваются в
                качестве одностороннего отказа Заказчика от Договора.<br/>
                В указанном случае Договор автоматически прекращается, плата,
                полученная Исполнителем, возврату не подлежит и рассматривается в
                качестве платы за отказ Заказчика от Договора. Исполнитель вправе
                распорядиться результатами работы по собственному усмотрению, в
                том числе, передать результаты работы третьим лицам за плату или
                без таковой.<br/>
                5. Оплата услуг и порядок расчетов<br/>
                5.1. Стоимость оказываемых услуг по договору оказания услуг зависит от выбранного Заказчиком Тарифа:<br/>
                5.1.1. Тариф «Lite Match»<br/>
                Стоимость 12000 (двенадцать тысяч) рублей при оплате после 15.05.2024
                5.1.2. Тариф «Comfort Match»<br/>
                Стоимость 24000 (двадцать четыре тысячи) рублей при оплате после 15.05.2024
                5.1.3. Тариф «Business Match»<br/>
                Стоимость 60000 (шестьдесят тысяч) рублей при оплате после 15.05.2024
                5.2. Оплата услуг по договору оказания услуг производится Заказчиком в 100 % (сто процентной) предоплаты, путем перевода денежных средств Исполнителю в рамках применяемых форм безналичных расчетов в соответствии с пунктом 3 статьи 16.1 Закона от 07.02.1992 № 2300-1 «О защите прав потребителей» и Федеральным законом от 27.06.2011 № 161-ФЗ «О национальной платежной системе».<br/>
                5.3. Обязанность Заказчика по оплате оказанных услуг считается исполненной с даты поступления денежных средств на банковский счет Исполнителя.<br/>
                5.4. В случае невозможности исполнения, возникшей по вине Заказчика, услуги подлежат оплате в полном объеме.<br/>
                5.5. В случае когда невозможность исполнения возникла по обстоятельствам, за которые ни одна из Сторон не отвечает, Заказчик возмещает Исполнителю фактически понесенные им расходы.<br/>
                6. Ответственность<br/>
                6.1. Исполнитель несет ответственность за своевременное предоставление услуг при выполнении Заказчиком установленных в настоящей оферте требований и правил.<br/>
                6.2. Стороны освобождаются от ответственности за частичное или полное неисполнение своих обязательств по настоящей оферте, если неисполнение обязательств явилось следствием обстоятельств непреодолимой силы, возникших после заключения настоящего договора в результате событий чрезвычайного характера, которые Сторона не могла ни предвидеть, ни предотвратить разумными мерами. К обстоятельствам непреодолимой силы относятся события, на которые Сторона не может оказать влияния и за возникновение которых она не несет ответственности.<br/>
                6.3. Исполнитель не несет ответственности за несоответствие предоставленной услуги ожиданиям Заказчика и(или) за его субъективную оценку.<br/>
                6.4. Исполнитель не несет ответственности за качество каналов связи общего пользования или служб, предоставляющих доступ Заказчика к его услугам.<br/>
                6.5. Исполнитель не несет ответственности за правильность предоставляемой Заказчиком информации при регистрации на сайте.<br/>
                6.6. Несоответствие ожиданиям и (или) отрицательная субъективная оценка не являются основаниями считать услуги оказанными некачественно или не в согласованном объеме. Также не являются такими основаниями мнения третьих лиц, отличные от мнения Исполнителя (его сотрудников и(или) партнеров).<br/>
                6.7. В случае, если Заказчик, по причинам, не зависящим от Исполнителя, не воспользовался Услугами и не уведомил Исполнителя о своем желании отказаться от Услуг в порядке, предусмотренном настоящей Офертой, Услуги считаются предоставленными.<br/>
                6.8. Исполнитель не несет ответственности за технические неполадки работы сайта. Исполнитель прилагает все разумные усилия, предотвращающие сбои и неполадки в работе Сайта, однако не гарантирует его бесперебойную работу, не обязуется уведомлять Заказчика о перебоях.<br/>
                7. Порядок рассмотрения споров и претензий<br/>
                7.1. Претензии Заказчика принимаются Исполнителем к рассмотрению по электронной почте в течение 10 (десяти) дней с момента возникновения спорной ситуации.<br/>
                7.2. Споры и разногласия, которые могут возникнуть при исполнении настоящей оферты, будут по возможности разрешаться путем переговоров между Заказчиком и Владельцем агрегатора.<br/>
                7.3. В случае недостижения соглашения споры разрешаются в судебном порядке в соответствии с действующим законодательством Российской Федерации.<br/>
                8. Обработка персональных данных<br/>
                8.1. Под обработкой персональных данных в настоящей оферте понимается сбор, систематизация, накопление, хранение, использование, уточнение (обновление, изменение), блокирование, уничтожение персональных данных Заказчика в целях оказания услуг.<br/>
                8.2. Стороны обязуются при обработке персональных данных Клиентов в полном объеме соблюдать требования Закона о персональных данных, а также изданных в его исполнение нормативных документов. Целью обработки персональных данных Клиентов во всех случаях является исполнение Договора. Сроки хранения персональных данных определяются законодательством Российской Федерации.<br/>
                8.3. Обработка персональных данных осуществляется Исполнителем автоматизированным способом.<br/>
                8.4. К обработке персональных данных Заказчика могут иметь доступ только работники, допущенные к работе с персональными данными Заказчика и подписавшие соглашение о неразглашении персональных данных.<br/>
                8.5. Принимая настоящую оферту, Заказчик дает согласие на обработку его персональных данных, а именно:<br/>
                8.5.1. В отношении физических лиц:<br/>
                - Фамилия, имя, отчество;<br/>
                - Почтовый адрес;<br/>
                - Электронный адрес;<br/>
                - Номера телефонов;<br/>
                - Год, месяц, дата рождения;<br/>
                - Паспортные данные.<br/>
                8.5.2. В отношении юридических лиц и индивидуальных предпринимателей:<br/>
                - Фамилия, имя, отчество руководителя юридического лица или индивидуального предпринимателя;<br/>
                - Номер телефона;<br/>
                - Электронный адрес;<br/>
                - Реквизиты юридического лица или индивидуального предпринимателя (ИНН, ОГРН);<br/>
                - Реквизиты счета для получения денежных средств.<br/>
                9. Конфиденциальность<br/>
                9.1. Стороны договорились сохранять в режиме конфиденциальности любые сведения, полученные одной Стороной в отношении другой в ходе исполнения настоящего договора.<br/>
                9.2. Режим конфиденциальности распространяется на любую иную информацию, которую любая из Сторон идентифицирует как конфиденциальную до или сразу после ее предоставления другой Стороне.<br/>
                9.3. К информации, признаваемой в соответствии с настоящим договором конфиденциальной, не могут относиться сведения, являющиеся в соответствии с требованиями российского законодательства общедоступными.<br/>
                9.4. Обязательства о конфиденциальности сохраняют силу в течение 3 (трех) лет после истечения срока действия или расторжения договора возмездного оказания услуг.<br/>
                9.5. За нарушение режима конфиденциальности Сторона, совершившая подобное нарушение, обязана возместить другой Стороне возникшие у нее, в связи с этим нарушением понесенные прямые убытки.<br/>
                10. Заключение, изменение, расторжение настоящего договора<br/>
                10.1. Настоящий договор считается заключенным с момента зачисления на расчетный счет Исполнителя денежных средств, уплаченных Заказчиком в счет оплаты заказанных им услуг, а также заполнения заявки на Сайте, содержащей персональные данные Заказчика, необходимой для предоставления услуг.<br/>
                10.2. Договор, может быть расторгнут досрочно по соглашению Сторон или в одностороннем порядке в случаях, предусмотренных законодательством Российской Федерации.<br/>
                10.3. Стороны вправе расторгнуть Договор по взаимному согласию в любой момент до фактического исполнения Договора.<br/>
                11. Реквизиты Исполнителя<br/>
                Наименование: ИП Баранова Елизавета Дмитриевна<br/>
                ИНН 502724507201, КПП 997 950 001, ОГРН (ОГРНИП) 324508100003686<br/>
                Банк ООО "Банк Точка"<br/>
                Р/с 40802810420000207489, БИК 044525104, к/с 30101810745374525104<br/>
                Юридический адрес: 140050, Россия, обл Московская, г Люберцы, дп Красково, ш Егорьевское, д. 1<br/>
                E-mail: womentowomen@gmail.com<br/>
                </p>
            </div>
        </>
    )
};

export default PolicyProcessingPersonalDataDocument;